@kayrus  That is weird, real quick I tested the same thing on my local devstack machine (latest openstack build) instead of the cloud provider. And the same thing happens, I can create a volume with UUID in the `volume_type` parameter. But the second I do `terraform plan`, you will see that it wants to replace the volume aswell because of the same reason.
```
rmnijgh@pc:~/test2$ terraform apply

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # openstack_blockstorage_volume_v3.volume_1 will be created
  + resource "openstack_blockstorage_volume_v3" "volume_1" {
      + attachment        = (known after apply)
      + availability_zone = "nova"
      + description       = "first test volume"
      + id                = (known after apply)
      + metadata          = (known after apply)
      + name              = "volume_1"
      + region            = (known after apply)
      + size              = 3
      + volume_type       = "74641f9e-b431-472a-bba7-ff067f5b0415"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

openstack_blockstorage_volume_v3.volume_1: Creating...
openstack_blockstorage_volume_v3.volume_1: Still creating... [10s elapsed]
openstack_blockstorage_volume_v3.volume_1: Creation complete after 10s [id=6673a1de-6766-408b-912d-46efb548525b]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
rmnijgh@pc:~/test2$ terraform plan
openstack_blockstorage_volume_v3.volume_1: Refreshing state... [id=6673a1de-6766-408b-912d-46efb548525b]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # openstack_blockstorage_volume_v3.volume_1 must be replaced
-/+ resource "openstack_blockstorage_volume_v3" "volume_1" {
      ~ attachment        = [] -> (known after apply)
      ~ id                = "6673a1de-6766-408b-912d-46efb548525b" -> (known after apply)
      ~ metadata          = {} -> (known after apply)
        name              = "volume_1"
      ~ region            = "RegionOne" -> (known after apply)
      ~ volume_type       = "lvmdriver-1" -> "74641f9e-b431-472a-bba7-ff067f5b0415" # forces replacement
        # (6 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```


Here I have debug output from the build towards the public cloud. Its alot of lines, if I'm missing something let me know:
```
2024-07-23T18:42:48.234Z [INFO]  provider.terraform-provider-openstack_v2.1.0: 2024/07/23 18:42:48 [DEBUG] OpenStack Request Body: {
  "volume": {
    "availability_zone": "AMS-EU4",
    "description": "first test volume",
    "name": "volume_1",
    "size": 3,
    "volume_type": "575c147c-1a64-4674-bd8d-da8c98be9dba"
  }
}: timestamp=2024-07-23T18:42:48.234Z
2024-07-23T18:42:48.700Z [INFO]  provider.terraform-provider-openstack_v2.1.0: 2024/07/23 18:42:48 [DEBUG] OpenStack Response Code: 202: timestamp=2024-07-23T18:42:48.700Z
2024-07-23T18:42:48.700Z [INFO]  provider.terraform-provider-openstack_v2.1.0: 2024/07/23 18:42:48 [DEBUG] OpenStack Response Headers:
Connection: keep-alive
Content-Length: 831
Content-Type: application/json
Date: Tue, 23 Jul 2024 18:42:48 GMT
Openstack-Api-Version: volume 3.0
Server: nginx
Vary: OpenStack-API-Version
X-Compute-Request-Id: req-ef359f52-491d-45f6-a0c1-f97b476f32e1
X-Openstack-Request-Id: req-ef359f52-491d-45f6-a0c1-f97b476f32e1: timestamp=2024-07-23T18:42:48.700Z
2024-07-23T18:42:48.700Z [INFO]  provider.terraform-provider-openstack_v2.1.0: 2024/07/23 18:42:48 [DEBUG] OpenStack Response Body: {
  "volume": {
    "attachments": [],
    "availability_zone": "AMS-EU4",
    "bootable": "false",
    "consistencygroup_id": null,
    "created_at": "2024-07-23T18:42:48.581151",
    "description": "first test volume",
    "encrypted": false,
    "id": "8e13866a-9977-4927-a4e8-c76cfbbfdffb",
    "links": [
      {
        "href": "https://volume.openstack.cloudvps.com/v3/b1593bc2d19e4b94ae815eec6f569d87/volumes/8e13866a-9977-4927-a4e8-c76cfbbfdffb",
        "rel": "self"
      },
      {
        "href": "https://volume.openstack.cloudvps.com/b1593bc2d19e4b94ae815eec6f569d87/volumes/8e13866a-9977-4927-a4e8-c76cfbbfdffb",
        "rel": "bookmark"
      }
    ],
    "metadata": {},
    "multiattach": false,
    "name": "volume_1",
    "replication_status": null,
    "size": 3,
    "snapshot_id": null,
    "source_volid": null,
    "status": "creating",
    "updated_at": null,
    "user_id": "k2k:ca5a98567fa64021a37883b38e1a4a90",
    "volume_type": "PERFORMANCE-Y1"
  }
}: timestamp=2024-07-23T18:42:48.700Z
```
